app/views/articles/index.html.erb

SELECT COUNT(*) FROM `comments` WHERE (`comments`.article_id = 1)
---
    <%= link_to h(article.name), article %>
    <span class="comments">(<%= pluralize(article.comments.size, 'comment') %>)</span>