app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE (`articles`.`id` = 1) LIMIT 1

  def create
    @article = Article.new(params[:article])
    @article.user = current_user
    if @article.save
---
INSERT INTO `articles` (`name`, `content`, `author_name`, `user_id`, `created_at`, `updated_at`) VALUES ('test', 'fdsjfkds', 'lxneng', 1, '2010-12-01 14:16:24', '2010-12-01 14:16:24')