app/controllers/comments_controller.rb

  def create
    @comment.user = current_user
    if @comment.save
---
INSERT INTO `comments` (`article_id`, `author_name`, `site_url`, `content`, `user_id`, `created_at`, `updated_at`) VALUES (2, 'lxneng', '', 'dfsjkfsjd\r\n', 1, '2010-12-01 14:42:57', '2010-12-01 14:42:57')
UPDATE `users` SET `last_request_at` = '2010-12-01 14:42:57', `updated_at` = '2010-12-01 14:42:57' WHERE (`users`.`id` = 1)

  def update
    if @comment.update_attributes(params[:comment])
---
UPDATE `comments` SET `content` = 'dfsjkfsjd\r\nsdfdfsdfsd', `updated_at` = '2010-12-01 14:47:37' WHERE (`comments`.`id` = 1)