app/controllers/password_resets_controller.rb

 def create
   @user = User.find_by_email(params[:email])
---
SELECT `users`.* FROM `users` WHERE (`users`.`email` = 'lxneng@gmail.com') LIMIT 1

 def load_user_using_perishable_token
   @user = User.find_using_perishable_token(params[:id])
---
SELECT `users`.`id` FROM `users` WHERE (`users`.`perishable_token` = BINARY 'd0yUg7wlBuFA0Bv3NjE') AND (`users`.id <> 1) LIMIT 1